Revit 2027 API
FillPattern.GetFillGrids Method
 Gets all fill grids in this fill pattern
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IList<FillGrid> GetFillGrids()
Public Function GetFillGrids As IList(Of FillGrid)
public:
IList<FillGrid^>^ GetFillGrids()
member GetFillGrids : unit -> IList<FillGrid>
Return Value
IList<FillGrid>
 The fill grids.
See Also
Reference
FillPattern Class
Autodesk.Revit.DB Namespace